<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest yq
                ARCH Input:
                amd64 for Intel based Macs
                arm64 for Arm based Macs
                
                FILENAME_ARCH:
                Use Intel or Arm depending
                on architecture of package</string>
        <key>Identifier</key>
        <string>com.github.jamesdurler.autopkg-recipes.download.yq</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>yq</string>
            <key>ARCH</key>
            <string>amd64</string>
            <key>FILENAME_ARCH</key>
            <string>Intel</string>
        </dict>
        <key>MinimumVersion</key>
        <string>2.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>GitHubReleasesInfoProvider</string>
                <key>Arguments</key>
                <dict>
                    <key>asset_regex</key>
                    <string>yq_darwin_%ARCH%</string>
                    <key>github_repo</key>
                    <string>mikefarah/yq</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%-%FILENAME_ARCH%-%version%</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>
