<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest yq and builds a package</string>
        <key>Identifier</key>
        <string>com.github.jamesdurler.autopkg-recipes.pkg.yq</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>yq</string>
            <key>PKG_ID</key>
            <string>com.github.mikefarah.yq</string>
            <key>FILENAME_ARCH</key>
            <string>Intel</string>
        </dict>
        <key>MinimumVersion</key>
        <string>2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.jamesdurler.autopkg-recipes.download.yq</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkgdirs</key>
                    <dict>
                        <key>payload</key>
                        <string>0755</string>
                        <key>payload/usr</key>
                        <string>0755</string>
                        <key>payload/usr/local</key>
                        <string>0755</string>
                        <key>payload/usr/local/bin</key>
                        <string>0755</string>
                    </dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%FILENAME_ARCH%</string>
                </dict>
                <key>Processor</key>
                <string>PkgRootCreator</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%FILENAME_ARCH%/payload/usr/local/bin/yq</string>
                    <key>source_path</key>
                    <string>%pathname%</string>
                </dict>
                <key>Processor</key>
                <string>Copier</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_request</key>
                    <dict>
                        <key>chown</key>
                        <array>
                            <dict>
                                <key>group</key>
                                <string>wheel</string>
                                <key>mode</key>
                                <string>0755</string>
                                <key>path</key>
                                <string>usr/local/bin/yq</string>
                                <key>user</key>
                                <string>root</string>
                            </dict>
                        </array>
                        <key>force_pkg_build</key>
                        <false/>
                        <key>id</key>
                        <string>%PKG_ID%</string>
                        <key>options</key>
                        <string>purge_ds_store</string>
                        <key>pkgname</key>
                        <string>%NAME%-%FILENAME_ARCH%-%version%</string>
                        <key>pkgroot</key>
                        <string>%RECIPE_CACHE_DIR%/%NAME%-%FILENAME_ARCH%/payload</string>
                        <key>version</key>
                        <string>%version%</string>
                    </dict>
                </dict>
                <key>Processor</key>
                <string>PkgCreator</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PathDeleter</string>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/%NAME%-%FILENAME_ARCH%</string>
                    </array>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
